/********************************************************************************
 * (c) Copyright 2017-2020, LME, All Rights Reserved。
 * THIS IS UNPUBLISHED PROPRIETARY SOURCE CODE OF LME, INC。
 * The copyright notice above does not evidence any actual or intended
 * publication of such source code。
 *
 * FileName    : APP_RxBuffer.h
 * Author      : dingy
 * Date        : 2020-04-17
 * Version     : 1.0
 * Description : APP层的接收缓存模块的头文件
 *             :
 * Others      :
 * ModifyRecord:
 *
 ********************************************************************************/
#ifndef _APP_RX_BUFFER_H_
#define _APP_RX_BUFFER_H_
/*******************************************************************************/

#include "plcp_panel.h"

/**********************************宏定义 开始*************************************/
#define APP_RX_BUFFER_SIZE 2048				   // APP层接收缓存的大小
#define APP_RX_BUFFER_DATA_PARAM_ARRAY_SIZE 4 // APP层接收缓存中接收数据参数队列的大小

/**********************************宏定义 结束*************************************/

/**********************************枚举声明 开始************************************/

/**********************************枚举声明 结束************************************/

/**********************************结构体声明 开始***********************************/
typedef struct
{
	uint16_t rxDataLen; // 接收数据载荷长度
	uint8_t *rxData;	   // 接收数据载荷内容
} RxDataParametersStruct;

/**********************************结构体声明 结束***********************************/

/***********************************函数声明 开始***********************************/

/*-------------------------------------------------------------
函数名称：APP_RxBuffer_init
函数功能：APP层接收缓存的初始化。
输入参数：无
返回值：无
备 注：
---------------------------------------------------------------*/
void APP_RxBuffer_init(void);

/*-------------------------------------------------------------
函数名称：APP_RxBuffer_Add
函数功能：APP层接收缓存添加一个元素。
输入参数：inputDataPointer -- 添加数据的指针
        inputDataLen -- 添加数据的长度
返回值： 0-添加失败，1-添加成功
备 注：
---------------------------------------------------------------*/
uint8_t APP_RxBuffer_Add(RxDataParametersStruct *param);

/*-------------------------------------------------------------
函数名称：APP_RxBuffer_DeleteFirstMsg
函数功能：APP层接收缓存删除第一条消息。
输入参数：deleteDataLen -- 删除数据的长度
返回值：  0-删除失败，1-删除成功
备 注：
---------------------------------------------------------------*/
uint8_t APP_RxBuffer_DeleteFirstMsg(void);

/*-------------------------------------------------------------
函数名称：APP_RxBuffer_GetFirstMsgDataParameters
函数功能：APP层接收缓存获取第一条消息的参数
输出参数：firstMsgDataParam -  接收缓存第一条消息的参数
返回值： 0-失败，1-成功
备 注：
---------------------------------------------------------------*/
uint8_t APP_RxBuffer_GetFirstMsgDataParameters(RxDataParametersStruct *firstMsgDataParam);

/*----------------------------11----------------------------------
函数名称：APP_RxBuffer_getRxBufferMsgAmount
函数功能：获取rxBuffer中的信息数量。
输入参数：无
返回值：无
备 注：
---------------------------------------------------------------*/
uint16_t APP_RxBuffer_getRxBufferMsgAmount(void);

/***********************************函数声明 结束***********************************/

#endif



